Country.seed(:id) do |s|
  s.id = 1
  s.name_ja = "日本"
  s.name_en = "Japan"
  s.currency = "¥(JPN)"
  s.language = "日本語"
  s.overview = "最先端の近代性と古代の伝統とが共存する土地を経験するために日本を訪れてください。首都の東京都は世界有数の技術拠点のひとつです。1300万人以上の人口を誇る都市中心部は、ナイトライフ、おいしい食べ物、活気のある芸術、劇場、音楽シーンなど、華やかで光るネオンライトメトロポリスです。 
しかし、日本の旅行は東京で終わるべきではありません。京都市は伝統的な服で芸者の踊りを見ることができる文化的な宝物です。 
富士山は日本の象徴とされています。 
日本で最も高い山であるからということだけでなく、その風貌があまりに独特で美しいからです。 
2013年には世界遺産にも登録されました。"
  s.things_to_go = "・息を呑むような景色を楽しめる日本アルプスのハイキング 
・京都の伝統的な踊りを楽しむ芸者の観賞 
・東京の無数のバーで人気のカレーを歌う 
・東京の多くの寿司レストランで新鮮な刺身をお楽しみください。 
・日本では人気のあるスポーツ、野球の試合に行く。"
  s.when_to_go = "気温が快適な春や秋に日本を訪れるのが一番です。春は、3月中旬から4月中旬にかけての桜の洪水が見れます。訪れるのに最適な時期かもしれません。夏には日本を避けたほうが良いかもしれません。暑さに増して湿っぽく、湿気があり、不快感を募らせます。"
end

Country.seed(:id) do |s|
  s.id = 2
  s.name_ja = "アメリカ"
  s.name_en = "United States"
  s.currency = "$(USD)"
  s.language = "英語"
  s.overview = "歴史的なランドマーク、世界的に有名な都市、そして世界の舞台での中心的存在である米国は、地球上で最も人気のある観光地です。 毎年、約6500万人が米国に旅行し、125億ドル以上を費やしています。 米国は、人口と地域別に世界第3位の国であり、世界で最大の経済を持っています。観光、レストラン、そして滞在するホテルの無限の選択を提供します。 地球上で最も大きくダイナミックな国の一つとして、米国は訪問者に信じられないほど多様な経験を提供しています。旅行者は米国を訪れることで、まったく異なる経験をすることができます。"
  s.things_to_go = "ワシントンDCのナショナル・モールには、リンカーン記念館、ワシントン記念碑、米国議会があります。徒歩圏内には大統領の家であるホワイトハウスがあります。 
・アリゾナ州のグランドキャニオンは、地球上で最も息を飲む地形の一つです。それは長さ277マイル、幅18マイル、深さ1マイル以上です。 
・フロリダ州オーランドにはウォルト・ディズニー・ワールドがあり、他にも有名な遊園地がたくさんあります。 
・世界で最も魅力的なカジノであなたの運を試したいですか？そう思ったなら、世界のギャンブル・キャピタルであるラスベガスを訪れてください。 
・アメリカ最大の都市ニューヨークは見所が満載です。9-11記念館、エンパイア・ステート・ビル、自由の女神を訪れてください。 
・素晴らしいアウトドアを探索してみましょう。米国には多くの国立公園が存在します。イエローストーン、デナリ、アカディアをお勧めします"
  s.when_to_go = "巨大な大きさと地理的多様性を持つ米国は、地域によって様々な気候になります。一年中訪れることができ、多くのことができます。フロリダ、カリフォルニア、ハワイのビーチでくつろいだりする場合は、夏にお勧めします。あなたがウィンタースポーツをする場合は、冬にコロラドやバーモントに向かいましょう。"
end

Country.seed(:id) do |s|
  s.id = 3
  s.name_ja = "イギリス"
  s.name_en = "England"
  s.currency = "£(GBP)"
  s.language = "英語"
  s.overview = "イングランドは3つのセクションに分かれています。それぞれ独自の歴史、人気のある都市、素晴らしいナイトライフがあります。 英国には、ロンドン、ブライトン、リバプール、マンチェスター、ブリストルなど、観光旅行の主なターゲットとなる都市が少なくとも9つあります。ロンドンはもちろん、旅行者がイングランドを訪れる際に気になる最初の都市です。都市のアイコンにはロンドン塔と議会議事堂がありますが、これらの建物の他にもたくさんの見所があります。大英博物館、テート・モダン、ウエスト・エンド劇場、ビクトリア＆アルバート博物館などの歴史を持つロンドンは、歴史、政治、芸術で生きています。"
  s.things_to_go = "イングランドの旅行計画をロンドンに限定しないでください。 イングランドは他の都市でも、多くの人気観光地があります。
・ブライトンのロイヤルパビリオン
・ノッティンガムの洞窟市
・マンチェスターの科学産業博物館
・ジョンレノンの家リバプールで（ビートルズのファンの方必見）
・ブリストルのフェリーボート"
  s.when_to_go = "6月から8月の旅行がおすすめです。しかし、いつでも比較的穏やかな気温で過ごすことができます。冬には、ロンドン塔やウィンチェスター大聖堂など、人気のある場所に近い場所に多くの屋外アイススケートリンクがあります。秋になって、葉が変わると国全体が赤と黄色に浮かびます。"
end

Country.seed(:id) do |s|
  s.id =4
  s.name_ja = "フランス"
  s.name_en = "France"
  s.currency = "€(EUR)"
  s.language = 'フランス語'
  s.overview = "ヨーロッパ最大の国の一つとして、フランス全土を巡ることは難しいかもしれませんが、フランスに旅行してその文化を最大限に楽しむことは可能です。フランスを訪れる人には、フランスアルプスから地中海の砂浜にいたるまで、様々な地形があり、訪問者が自分の旅行を自分でデザインする機会を提供します。さらに、フランスは歴史の豊富な国であり、世界で最も有名な美術館、モニュメント、建築功労史料館などがあります。主要な目的地として、フランスの旅行は簡単で、訪問者は言語障壁であってもナビゲートが比較的容易で、予算に優しい休暇や贅沢な逃避を求める観光客に適しています。訪問の理由が何であれ、その国は今後数年間、繰り返し訪れていることに感心しています。"
  s.things_to_go = "・おいしい、地元産のサイダーやリンゴのブランデーのためにシャンパンやボルドーのワイナリー、フランスワインの国の心、あるいはノルマンディーに頭を訪問
 マルセイユ、ニースとモンペリエの都市訪問し、フランスのリビエラの最高に乗り
 ・経験フランス語をフランス語、スペイン国境に位置ビアリッツのバスク文化は、
 ・パリのルーブル美術館、エッフェル塔、チュイルリー庭園やその他の忘れられない光景を参照してください。
 フレンチアルプスのスキー、スノーボードと登山に簡単にアクセスグルノーブルへ•頭を
 ・都市をチェックアウトストラスブールは、フランスとドイツの文化遺産を共有し、欧州議会の議席となっています
 ・ヴィンセント・ヴァン・ゴッホの足跡をたどって、非常に魅力的なアルルの街に滞在して、彼が最も素晴らしい作品をいくつか作った"
  s.when_to_go = "その大きさの国と同様に、気候は温暖な気候（パリの夏は日常気温が80度を超えることはめったにありません）とフランスの南東の帯を暖かく温暖化させる地中海気候、湿った夏と穏やかで涼しい冬。それでも、春と夏は、国が提供しなければならない最高の天候を迎えるチャンスがあれば、フランスを訪れるのに最適な時期です。もちろん、もっと冬の活動に参加することを望んでいる場合を除きます。その場合、フランスとフランスのアルプスを訪れるのに最適な時期は12月から3月です。"
end
