Country.seed(:id) do |s|
  s.id = 1
  s.name_ja = "日本"
  s.name_en = "Japan"
  s.currency = "¥(JPN)"
  s.language = "日本語"
  s.overview = "最先端の近代性と古代の伝統とが共存する土地を経験するために日本を訪れてください。首都の東京都は世界有数の技術拠点のひとつです。1300万人以上の人口を誇る都市中心部は、ナイトライフ、おいしい食べ物、活気のある芸術、劇場、音楽シーンなど、華やかで光るネオンライトメトロポリスです。 
しかし、日本の旅行は東京で終わるべきではありません。京都市は伝統的な服で芸者の踊りを見ることができる文化的な宝物です。 
富士山は日本の象徴とされています。 
日本で最も高い山であるからということだけでなく、その風貌があまりに独特で美しいからです。 
2013年には世界遺産にも登録されました。"
  s.things_to_go = "・息を呑むような景色を楽しめる日本アルプスのハイキング 
・京都の伝統的な踊りを楽しむ芸者の観賞 
・東京の無数のバーで人気のカレーを歌う 
・東京の多くの寿司レストランで新鮮な刺身をお楽しみください。 
・日本では人気のあるスポーツ、野球の試合に行く。"
  s.when_to_go = "気温が快適な春や秋に日本を訪れるのが一番です。春は、3月中旬から4月中旬にかけての桜の洪水が見れます。訪れるのに最適な時期かもしれません。夏には日本を避けたほうが良いかもしれません。暑さに増して湿っぽく、湿気があり、不快感を募らせます。"
end

Country.seed(:id) do |s|
  s.id = 2
  s.name_ja = "アメリカ"
  s.name_en = "United States"
  s.currency = "$(USD)"
  s.language = "英語"
  s.overview = "歴史的なランドマーク、世界的に有名な都市、そして世界の舞台での中心的存在である米国は、地球上で最も人気のある観光地です。 毎年、約6500万人が米国に旅行し、125億ドル以上を費やしています。 米国は、人口と地域別に世界第3位の国であり、世界で最大の経済を持っています。観光、レストラン、そして滞在するホテルの無限の選択を提供します。 地球上で最も大きくダイナミックな国の一つとして、米国は訪問者に信じられないほど多様な経験を提供しています。旅行者は米国を訪れることで、まったく異なる経験をすることができます。"
  s.things_to_go = "ワシントンDCのナショナル・モールには、リンカーン記念館、ワシントン記念碑、米国議会があります。徒歩圏内には大統領の家であるホワイトハウスがあります。 
・アリゾナ州のグランドキャニオンは、地球上で最も息を飲む地形の一つです。それは長さ277マイル、幅18マイル、深さ1マイル以上です。 
・フロリダ州オーランドにはウォルト・ディズニー・ワールドがあり、他にも有名な遊園地がたくさんあります。
・世界で最も魅力的なカジノであなたの運を試したいですか？そう思ったなら、世界のギャンブル・キャピタルであるラスベガスを訪れてください。 
・アメリカ最大の都市ニューヨークは見所が満載です。9-11記念館、エンパイア・ステート・ビル、自由の女神を訪れてください。 
・素晴らしいアウトドアを探索してみましょう。米国には多くの国立公園が存在します。イエローストーン、デナリ、アカディアをお勧めします"
  s.when_to_go = "巨大な大きさと地理的多様性を持つ米国は、地域によって様々な気候になります。一年中訪れることができ、多くのことができます。フロリダ、カリフォルニア、ハワイのビーチでくつろいだりする場合は、夏にお勧めします。あなたがウィンタースポーツをする場合は、冬にコロラドやバーモントに向かいましょう。"
end

Country.seed(:id) do |s|
  s.id = 3
  s.name_ja = "イギリス"
  s.name_en = "England"
  s.currency = "£(GBP)"
  s.language = "英語"
  s.overview = "イングランドは3つのセクションに分かれています。それぞれ独自の歴史、人気のある都市、素晴らしいナイトライフがあります。 英国には、ロンドン、ブライトン、リバプール、マンチェスター、ブリストルなど、観光旅行の主なターゲットとなる都市が少なくとも9つあります。ロンドンはもちろん、旅行者がイングランドを訪れる際に気になる最初の都市です。都市のアイコンにはロンドン塔と議会議事堂がありますが、これらの建物の他にもたくさんの見所があります。大英博物館、テート・モダン、ウエスト・エンド劇場、ビクトリア＆アルバート博物館などの歴史を持つロンドンは、歴史、政治、芸術で生きています。"
  s.things_to_go = "イングランドの旅行計画をロンドンに限定しないでください。 イングランドは他の都市でも、多くの人気観光地があります。
・ブライトンのロイヤルパビリオン
・ノッティンガムの洞窟市
・マンチェスターの科学産業博物館
・ジョンレノンの家リバプールで（ビートルズのファンの方必見）
・ブリストルのフェリーボート"
  s.when_to_go = "6月から8月の旅行がおすすめです。しかし、いつでも比較的穏やかな気温で過ごすことができます。冬には、ロンドン塔やウィンチェスター大聖堂など、人気のある場所に近い場所に多くの屋外アイススケートリンクがあります。秋になって、葉が変わると国全体が赤と黄色に浮かびます。"
end

Country.seed(:id) do |s|
  s.id =4
  s.name_ja = "フランス"
  s.name_en = "France"
  s.currency = "€(EUR)"
  s.language = 'フランス語'
  s.overview = "ヨーロッパ最大の国の一つとして、フランス全土を巡ることは難しいかもしれませんが、フランスに旅行してその文化を最大限に楽しむことは可能です。フランスを訪れる人には、フランスアルプスから地中海の砂浜にいたるまで、様々な地形があり、訪問者が自分の旅行を自分でデザインする機会を提供します。さらに、フランスは歴史の豊富な国であり、世界で最も有名な美術館、モニュメント、建築功労史料館などがあります。主要な目的地として、フランスの旅行は簡単で、訪問者は言語障壁であってもナビゲートが比較的容易で、予算に優しい休暇や贅沢な逃避を求める観光客に適しています。訪問の理由が何であれ、その国は今後数年間、繰り返し訪れていることに感心しています。"
  s.things_to_go = "・おいしい、地元産のサイダーやリンゴのブランデーのためにシャンパンやボルドーのワイナリー、フランスワインの国の心、あるいはノルマンディーに頭を訪問
 マルセイユ、ニースとモンペリエの都市訪問し、フランスのリビエラの最高に乗り
 ・経験フランス語をフランス語、スペイン国境に位置ビアリッツのバスク文化は、
 ・パリのルーブル美術館、エッフェル塔、チュイルリー庭園やその他の忘れられない光景を参照してください。
 フレンチアルプスのスキー、スノーボードと登山に簡単にアクセスグルノーブルへ•頭を
 ・都市をチェックアウトストラスブールは、フランスとドイツの文化遺産を共有し、欧州議会の議席となっています
 ・ヴィンセント・ヴァン・ゴッホの足跡をたどって、非常に魅力的なアルルの街に滞在して、彼が最も素晴らしい作品をいくつか作った"
  s.when_to_go = "その大きさの国と同様に、気候は温暖な気候（パリの夏は日常気温が80度を超えることはめったにありません）とフランスの南東の帯を暖かく温暖化させる地中海気候、湿った夏と穏やかで涼しい冬。それでも、春と夏は、国が提供しなければならない最高の天候を迎えるチャンスがあれば、フランスを訪れるのに最適な時期です。もちろん、もっと冬の活動に参加することを望んでいる場合を除きます。その場合、フランスとフランスのアルプスを訪れるのに最適な時期は12月から3月です。"
end

Country.seed(:id) do |s|
  s.id =5
  s.name_ja = "イタリア"
  s.name_en = "Italy"
  s.currency = "€(EUR)"
  s.language = 'イタリア語'
  s.overview = "イタリアはオリーブの木の下で飲み物をする徹夜ワイン、クリスタルブルーのティレニア海の上にある崖の上に建てられたパステルヴィラ、ルネサンスの絵画や大理石の彫刻など、忘れられないインスピレーションを与えてくれます。イタリアに旅行するのは誰の夢でもあり、正当な理由があります。ビーチや山、ぶどう畑、都市など、イタリアの旅行を楽しむための無限の可能性があります。旅行+レジャーのイタリア旅行ガイドをチェックして、食べる場所、滞在する場所、見所を決定してください。
始めるのに適した場所は、ローマの首都、西洋文明の発祥地であり、多くの壮大な歴史的出来事の場です。イタリアのすべての地域は異なり、ドロミテのスキーからエオリア諸島の日光浴まで、さまざまな種類の休暇に対応しています。"
  s.things_to_go = "・ヴェネツィアの運河に沿ってゴンドラをに乗る
・フィレンツェのドゥオーモの頂上に登る
・火山の街ポンペイを見学する
・チンクエ・テッレの5つの都市をハイキングする
・カプリの青い洞窟で泳ぐ
・トスカーナのブドウ畑
・パレルモのマッシモ劇場でのオペラ演奏をキャッチ"
  s.when_to_go = "イタリアの地中海の気候は、毎シーズンのスリリングなアクティビティで一年中賑わいます。一般的に、夏は暑く乾燥しており、冬は寒くて湿っています。一般的に、イタリアを訪れる最善の月は、4月から6月、9月から10月です。7月と8月は激しく暑くて激しく、ほとんどのイタリア人は8月に休暇をとり、多くのショップやレストランを閉鎖します。"
end

Country.seed(:id) do |s|
  s.id =6
  s.name_ja = "中国"
  s.name_en = "china"
  s.currency = "人民元(RMB)"
  s.language = '中国語'
  s.overview = "中国のように長く、複雑で魅力的な歴史を持つ文化はほとんどありません。多くの旅行者にとって中国を訪れる理由には、北京の紫禁城、万里の長城、西安のテラコッタ兵士があります。しかし、中国への旅行はまた、浦東の高層ビルや他の都市での爆発的な成長に反映される可能性のある繁栄している世界の力を見る機会を与えている。どこに行くにしても、この巨大な国を進むには、中国の旅行ガイドが不可欠です。"
  s.things_to_go = "平方マイルのアメリカよりもわずかに小さく、4倍の人口を抱えているため、中国は一回の訪問で完全に見ることは不可能です。しかし、必見観光スポットの一覧は、これらの象徴的なモニュメントと自然の驚異から始まるかもしれません
  ・中国の万里の長城
  ・紫禁城
  ・西安のテラコッタ兵士
  ・上海
  ・成都のパンダ"
  s.when_to_go = "北東部では、夏は暑く、冬は激しく寒く、南半球ではより亜熱帯の気候です。一般的に、天気の良い旅行時期は春と秋です。"
end

Country.seed(:id) do |s|
  s.id =7
  s.name_ja = "ドイツ"
  s.name_en = "Germany"
  s.currency = "€(EUR)"
  s.language = '　ドイツ語'
  s.overview = " ヨーロッパで最も劇的な景色や文化の歴史があります。美しいアルパイン地方では、冬には世界クラスのスキーを楽しめます。印象的なピカソコレクションを備えたルードヴィッヒ美術館のようなヨーロッパのトップ美術館の一部は、全国にあります。ユニークで地域的なビールスタイルや巨大なソーセージなど、国の文化のもう一つの大きな側面を楽しんでください"
  s.things_to_go = "・ミュンヘンは休暇の市場で有名です。ショッピングやおいしいホットワインの試飲が楽しめます。
 ・ドイツの旅行ガイドの助けを借りて、国の多くの国立公園の一つを探索してください。
 ・ベルリンのチェックポイントチャールズ - ベルリンの壁崩し博物館として知られています - ベルリンの壁の時代、そして西ベルリン人が西側に逃げようとする試みの中で、人生を魅力的に見せます。"
  s.when_to_go = "ドイツの大部分は、穏やかな夏と寒い冬で温暖な季節の気候です。このため、アルプスでのスキーはドイツを旅行する上での理由の1つですが、多くの旅行者は夏の間にドイツを訪れることを選択します。"
end

Country.seed(:id) do |s|
  s.id =8
  s.name_ja = "トルコ"
  s.name_en = "Turkey"
  s.currency = "(TL)"
  s.language = 'トルコ語'
  s.overview = "皇帝、詩人、商人、戦士、宗教的な巡礼者、探検家 - 何​​世紀にもわたって、現在はトルコとして知られている多様で美しい土地に引き寄せられました。世界で最も若い人口を持つスタイリッシュなイスタンブール、エーゲ海沿岸のシックなビーチタウン、地中海沿岸、世界的に有名な史跡遺跡、カッパドキアのような砂漠地帯の忘れられない景観があります。それに素晴らしい料理、有名なバザーや職人の貿易、退廃的なハマムのスパの伝統を加えてみましょう。"
  s.things_to_go = "・イスタンブールのグランドバザール、ドルマバフチェ宮殿、トプカピ宮殿を散策
・ボスポラス海峡のクルーズください
・エフェソス遺跡は、カッパドキアの洞窟や塔の上に熱気球に乗ってください
ビーチの上・ラウンジボドルム"
  s.when_to_go = "地中海とエーゲ海に接する地域は、夏には乾いて晴れた日があり、冬は涼しく湿っています。山岳地域では冬には雪が降り、冬のスポーツ愛好家には最適です。イスタンブールは一年中訪れることができます。春、夏、秋は、イスタンブールの屋外カフェ、ボスポラスクルーズ、都市公園を利用するのが最善です。"
end

Country.seed(:id) do |s|
  s.id =9
  s.name_ja = "メキシコ"
  s.name_en = "Mexico"
  s.currency = "M$(MXN)"
  s.language = 'スペイン語'
  s.overview = "歴史、美味しい食べ物、広大なビーチが豊富な国メキシコを訪れてください。古いメソポタミアの遺跡を歩き回ったり、国の多くのリゾートビーチの白い砂浜に乗ったり、ユカタン半島の水域からシュノーケリングをしたりすると楽しみがたくさんあります。"
  s.things_to_go = "・Cenote Taj-Mahalの海域へのダイビング。ユカタン半島に位置するこの石灰岩基盤は、ダイビングに最適な多くの淡水シンクホールを備えています。水中の洞穴や割れ目が水晶のように澄んだ水を捨てて、泳ぎを真にユニークなものにします。
 ・メキシコシティの歴史的中心部を歩く。主な広場には、ミュージカル公演やアートショーを主催するメキシコ・フェスティバル・デ・メキシコなど、多くの文化イベントが開催されています。
 ・メキシコで最も訪問された博物館を訪ねてください。国立人類学博物館には、メキシコのマヤ人、アステカ人、および他の元住民から回収された多くの人工物があります。博物館自体のユニークなデザインを見ることは価値があります。"
  s.when_to_go = "あなたがメキシコを訪れる最適な時期には、あなたがどこに行くかによって変化します。ユカタン半島に近い国の南部は一年中緩やかな気温がありますが、メキシコの北部は特に夏の間暖かい気温の気候がより乾燥しがちです。"
end

Country.seed(:id) do |s|
  s.id =10
  s.name_ja = "オーストラリア"
  s.name_en = "Australia"
  s.currency = "A$(AUD)"
  s.language = '英語'
  s.overview = "オーストラリアは、文化的にも地理的にも、非常に多様な島、大陸、そして国です。広く認識されている「アウトバック」は巨大な島の中心を占めていますが、他のほとんどの地域には熱帯雨林、山々や渓谷、世界的に有名なビーチなどがあります。オーストラリアの人口のほぼすべてが沿岸から50マイル以内に住んでいます。以前の[刑務所の植民地として、国は現在、近代的なコスモポリタンな文化と古代アボリジニの伝統が混在しています。パース、メルボルン、シドニーの都市は風光明媚で繁栄している鍋です。その国はいくつかの主要な場所を探索するために、多くの発見の旅行、または少なくとも2週間の中断を受ける必要があります。"
  s.things_to_go = "・Cenote Taj-Mahalの海域へのダイビング。ユカタン半島に位置するこの石灰岩基盤は、ダイビングに最適な多くの淡水シンクホールを備えています。水中の洞穴や割れ目が水晶のように澄んだ水を捨てて、泳ぎを真にユニークなものにします。
 ・メキシコシティの歴史的中心部を歩く。主な広場には、ミュージカル公演やアートショーを主催するメキシコ・フェスティバル・デ・メキシコなど、多くの文化イベントが開催されています。
 ・メキシコで最も訪問された博物館を訪ねてください。国立人類学博物館には、メキシコのマヤ人、アステカ人、および他の元住民から回収された多くの人工物があります。博物館自体のユニークなデザインを見ることは価値があります。"
  s.when_to_go = "あなたがメキシコを訪れる最適な時期には、あなたがどこに行くかによって変化します。ユカタン半島に近い国の南部は一年中緩やかな気温がありますが、メキシコの北部は特に夏の間暖かい気温の気候がより乾燥しがちです。"
end








